#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_password.os_password: Refreshing state... [id=none]
random_string.random: Refreshing state... [id=ftdr]
random_password.db_password: Refreshing state... [id=none]
aws_secretsmanager_secret.harbor_login: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:harbor-login-dev-gbtXqi]
aws_secretsmanager_secret.azure_app_client_secret: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:azure-app-client-secret-dev-TdBwjh]
data.aws_iam_policy_document.get_secrets_policy: Reading...
aws_secretsmanager_secret.azure_app_tenant_id: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:azure-app-tenant-id-dev-RHDTR2]
data.aws_iam_policy_document.elasticsearch-log-publishing-policy: Reading...
data.aws_acm_certificate.opensearch: Reading...
aws_kms_key.log_group_key: Refreshing state... [id=6aff413b-658e-4b1f-ac7f-08c7713fa2ad]
data.aws_caller_identity.current_account: Reading...
data.aws_iam_policy_document.ecs_task_role_assume_role_policy: Reading...
data.aws_iam_policy_document.ecs_task_role_policy: Reading...
data.aws_iam_policy_document.elasticsearch-log-publishing-policy: Read complete after 0s [id=2597252832]
data.aws_iam_policy_document.ecs_task_role_policy: Read complete after 0s [id=3789633034]
data.aws_iam_policy_document.get_secrets_policy: Read complete after 0s [id=258835557]
data.aws_iam_policy_document.ecs_task_role_assume_role_policy: Read complete after 0s [id=1077804475]
aws_vpc.vpc: Refreshing state... [id=vpc-066ba78b0a176317d]
data.aws_iam_policy_document.ecs_task_execution_role_assume_role_policy: Reading...
aws_secretsmanager_secret.postgres_credentials: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:dms-postgres-credentials-dev-XfSnAj]
aws_secretsmanager_secret.azure_app_client_id: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:azure-app-client-id-dev-sbpbZh]
data.aws_iam_policy_document.ecs_task_execution_role_assume_role_policy: Read complete after 0s [id=1077804475]
aws_secretsmanager_secret.opensearch_credentials: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:geoserver-postgres-credentials-dev-OTbKJB]
data.aws_caller_identity.current_account: Read complete after 0s [id=654654181948]
aws_secretsmanager_secret.app_secret_key: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:app-secret-key-dev-9fPB9j]
aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:eu-west-1:654654181948:cluster/dms-cluster-dev]
data.aws_route53_zone.opensearch: Reading...
aws_cloudwatch_log_resource_policy.elasticsearch-log-publishing-policy: Refreshing state... [id=elasticsearch-log-publishing-policy]
aws_iam_role.ecs_task_role: Refreshing state... [id=ecs-task-role-dev]
aws_secretsmanager_secret_version.harbor_login: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:harbor-login-dev-gbtXqi|A89D30B5-5F68-4FEF-882C-1EDEC41C187A]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecs-task-execution-role-dev]
aws_secretsmanager_secret_version.azure_app_client_id: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:azure-app-client-id-dev-sbpbZh|C0F15246-92D0-4818-810B-2D6649B69109]
aws_secretsmanager_secret_version.azure_app_tenant_id: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:azure-app-tenant-id-dev-RHDTR2|3E32B640-90AA-409D-9D18-C495BAA0AD1A]
aws_secretsmanager_secret_version.opensearch_credentials: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:geoserver-postgres-credentials-dev-OTbKJB|D6424FFA-45A4-4B4B-B1DB-865A27C2175F]
aws_secretsmanager_secret_version.azure_app_client_secret: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:azure-app-client-secret-dev-TdBwjh|18D105AB-2630-43BF-9E0B-C581EBB09BF7]
aws_secretsmanager_secret_version.app_secret_key: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:app-secret-key-dev-9fPB9j|DE155547-8C80-4176-8962-3A0B0D12ADC9]
aws_cloudwatch_log_group.opensearch_log_group_es_application_logs: Refreshing state... [id=/aws/es/dev20241205120702499500000005]
data.aws_acm_certificate.opensearch: Read complete after 1s [id=arn:aws:acm:eu-west-1:654654181948:certificate/bc14494c-2be8-47c8-9ab4-e95e40b3d41f]
aws_cloudwatch_log_group.opensearch_log_group_index_slow_logs: Refreshing state... [id=/aws/es/dev20241205120702501700000007]
aws_kms_key_policy.log_group_key_policy: Refreshing state... [id=6aff413b-658e-4b1f-ac7f-08c7713fa2ad]
aws_cloudwatch_log_group.ecs_log_group: Refreshing state... [id=/aws/vendedlogs/states/ecs-dev-20241205120702499100000004]
aws_cloudwatch_log_group.opensearch_log_group_search_slow_logs: Refreshing state... [id=/aws/es/dev20241205120702500000000006]
data.aws_route53_zone.opensearch: Read complete after 1s [id=Z0724547YPY8RPPKBNKT]
aws_ecs_cluster_capacity_providers.cluster: Refreshing state... [id=dms-cluster-dev]
aws_iam_role_policy.ecs_task_role_policy: Refreshing state... [id=ecs-task-role-dev:terraform-20241205120657553900000001]
aws_iam_role_policy_attachment.task_s3_access: Refreshing state... [id=ecs-task-role-dev-20241205120657692200000002]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment: Refreshing state... [id=ecs-task-execution-role-dev-20241205120657816100000003]
aws_iam_role_policy.password_policy_secretsmanager: Refreshing state... [id=ecs-task-execution-role-dev:dms-ecs-task-secretsmanager-dev]
data.aws_iam_policy_document.write_logs: Reading...
aws_ecs_task_definition.frontend: Refreshing state... [id=dms-frontend-dev]
data.aws_iam_policy_document.write_logs: Read complete after 0s [id=169222441]
aws_iam_role_policy.write_logs: Refreshing state... [id=ecs-task-execution-role-dev:dms-ecs-task-write-logs-dev]
aws_security_group.backend-ecs: Refreshing state... [id=sg-0f805d63f7c0528a9]
aws_security_group.frontend-ecs: Refreshing state... [id=sg-0358a94a73383cf72]
aws_subnet.az1a: Refreshing state... [id=subnet-01ced75c7e6c8b205]
aws_subnet.az1b: Refreshing state... [id=subnet-0941597bf1abf3772]
aws_security_group.opensearch_security_group: Refreshing state... [id=sg-0ba5003931eb0e574]
aws_lb_target_group.ecs_bg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:654654181948:targetgroup/ecs-target-group-backend-dev/b29331be96561a5c]
aws_security_group.dms-ecs: Refreshing state... [id=sg-01db2f4216a9f477e]
aws_lb_target_group.ecs_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:654654181948:targetgroup/ecs-target-group-dev/301700aa862c9ce1]
aws_internet_gateway.vpc: Refreshing state... [id=igw-099f5eeba8c9ed3c5]
aws_subnet.az1c: Refreshing state... [id=subnet-0e73b97f14982576e]
aws_security_group.default: Refreshing state... [id=sg-082306462a44fa9f2]
aws_security_group.task: Refreshing state... [id=sg-03f8afbb7b9b1e1f2]
aws_route.igw: Refreshing state... [id=r-rtb-0d53d356605091e941080289494]
aws_security_group.backend-alb: Refreshing state... [id=sg-01f064306d023cc21]
aws_security_group.frontend-alb: Refreshing state... [id=sg-065e8cb775395cb4b]
aws_security_group.dms-db: Refreshing state... [id=sg-0defe5192855ac63c]
aws_db_subnet_group.dms: Refreshing state... [id=postgres-dms-sn-group-dev]
aws_opensearch_domain.opensearch: Refreshing state... [id=arn:aws:es:eu-west-1:654654181948:domain/dms-engine-dev]
aws_vpc_security_group_egress_rule.allow_all_traffic_ipv4_task: Refreshing state... [id=sgr-0d7dc402a1d126e66]
aws_lb.ecs_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:654654181948:loadbalancer/app/ecs-alb-dev/cbce273e8c06bda4]
aws_ecs_service.frontend_service: Refreshing state... [id=arn:aws:ecs:eu-west-1:654654181948:service/dms-cluster-dev/frontend-service]
aws_lb_listener.ecs_alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:654654181948:listener/app/ecs-alb-dev/cbce273e8c06bda4/aa2fde9c00baa214]
aws_db_instance.dms: Refreshing state... [id=db-DMSVJTTS5XKPRNAT5YFXKD4VCA]
aws_secretsmanager_secret_version.postgres_credentials: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:dms-postgres-credentials-dev-XfSnAj|8D898C79-E3DA-4ADA-91A7-F33B6BF17C63]
aws_ecs_service.backend_service: Refreshing state... [id=arn:aws:ecs:eu-west-1:654654181948:service/dms-cluster-dev/backend-service]
aws_lb_listener_rule.backend_routing: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:654654181948:listener-rule/app/ecs-alb-dev/cbce273e8c06bda4/aa2fde9c00baa214/491df037535ad675]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_ecs_service.backend_service will be updated in-place
  ~ resource "aws_ecs_service" "backend_service" {
        id                                 = "arn:aws:ecs:eu-west-1:654654181948:service/dms-cluster-dev/backend-service"
        name                               = "backend-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-west-1:654654181948:task-definition/dms-backend-dev:9" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.backend will be created
  + resource "aws_ecs_task_definition" "backend" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "1024"
      + execution_role_arn       = "arn:aws:iam::654654181948:role/ecs-task-execution-role-dev"
      + family                   = "dms-backend-dev"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
      + task_role_arn            = "arn:aws:iam::654654181948:role/ecs-task-role-dev"
    }

  # aws_opensearch_domain.opensearch will be updated in-place
  ~ resource "aws_opensearch_domain" "opensearch" {
        id                 = "arn:aws:es:eu-west-1:654654181948:domain/dms-engine-dev"
        tags               = {}
        # (10 unchanged attributes hidden)

      ~ cluster_config {
            # (8 unchanged attributes hidden)

          + zone_awareness_config {
              + availability_zone_count = 2
            }

            # (1 unchanged block hidden)
        }

        # (14 unchanged blocks hidden)
    }

  # aws_security_group.opensearch_security_group will be updated in-place
  ~ resource "aws_security_group" "opensearch_security_group" {
        id                     = "sg-0ba5003931eb0e574"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "HTTP from VPC"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
        name                   = "dms-es-sg"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @N-Clerkx, Action: `pull_request`, Working Directory: `./infra`, Workflow: `Terraform Infrastructure Change Management Pipeline with GitHub Actions`*